#+TITLE:Org Cheatsheat
#+AUTHOR: Joshua Branson
#+STARTUP: latexpreview
#+LANGUAGE: en
#+HTML_HEAD <link rel="stylesheet" type="text/css" href="stylesheet.css" />
# The next lines says that I can make 10 levels of headlines, and org will treat those headlines as how to structure the book into
# chapters, then sections, then subsections, then sub-sub-sections, etc.
** sql
    #+name: my_query
    # results output and exports both let the exported file show both the code and the results in the exported file
    #+BEGIN_SRC sql :results output :exports both
      SELECT first, last FROM users WHERE last = 'Branson' limit 5
    #+END_SRC

    #+RESULTS: my_query
    | first  | last    |
    |--------+---------|
    | Joshua | Branson |
    | Joshua | Branson |
    | Joshua | Branson |
    | Joshua | Branson |

    That "my_query" block can be passed as input to the following code block
    #+BEGIN_SRC emacs-lisp :var x=my_query
      (print x)

    #+END_SRC

    #+RESULTS:
    | Joshua | Branson |
    | Joshua | Branson |
    | Joshua | Branson |
    | Joshua | Branson |

    One can also tell emacs NOT to export the results of a code execution via
    #+BEGIN_SRC emacs-lisp :exports none
      (print "hello")
    #+END_SRC

    #+RESULTS:
    : hello

    This just mean that when you export the document to html, pdf, .odt, etc., then you will not see that code block's source code or results.

  - A gnu plot example

    #+BEGIN_SRC gnuplot
    set title "My First Plot";  plot 'data';  print "all done!"
    #+END_SRC
** gnu calc
   #+BEGIN_SRC calc
     fsolve (x*2 + 4 = 5, x)
   #+END_SRC

   #+RESULTS:
   : x = 0.5

   #+BEGIN_SRC calc
   fsolve([x + y = a, x - y = b],[x,y])
   #+END_SRC

   #+RESULTS:
   : [x = a + (b - a) / 2, y = (a - b) / 2]

  #+BEGIN_SRC calc
  integ (x**2,x)
  #+END_SRC

  #+RESULTS:
  : x^3 / 3

** C code
   #+HEADERS: :includes <math.h> :flags -lm
   #+HEADERS: :var x=1.0 :var y=4.0 :var z=10.0
   #+BEGIN_SRC C :exports both
     double pi = 4*atan(1);
     double r, theta, phi;
     r = sqrt(x*x+y*y+z*z);
     theta = acos(z/r) * 180.0/pi;
     phi = atan2(y,x) * 180.0/pi;
     printf("%f %f %f", r, theta, phi);
   #+END_SRC

   #+RESULTS:
   : 10.816654 22.406871 75.963757

   To include multiple C header files
   #+BEGIN_SRC C :includes '(<math.h> <time.h>)

   #+END_SRC

** bash
  #+begin_src sh
  echo "This file takes up `du -h org-babel.org |sed 's/\([0-9k]*\)[ ]*org-babel.org/\1/'`"
  #+end_src

  #+RESULTS:
  : This file takes up

  #+begin_src sh
    pacman -Q firefox
  #+end_src

  #+RESULTS:
  : firefox 41.0.1-1

  This program lists duplicate files.  It runs md5sum on the files to find the duplicates
  https://www.maketecheasier.com/remove-duplicate-files-linux/
  #+BEGIN_SRC sh :dir ~/manuals/
  find -not -empty -type f -printf "%s\n" | sort -rn | uniq -d | xargs -I{} -n1 find -type f -size {}c -print0 | xargs -0 md5sum | sort | uniq -w32 --all-repeated=separate
  #+END_SRC

  #+RESULTS:
  | 2a44284ee46b6572872e5c704889eba4 | ./emacs.org                                               |
  | 2a44284ee46b6572872e5c704889eba4 | ./emacs.org.backup                                        |
  |                                  |                                                           |
  | 7ac95b56101e570db018311e775b7952 | ./ltxpng/org_8efa66ec78ea83e97f9815c08a43ee880750b6ee.png |
  | 7ac95b56101e570db018311e775b7952 | ./ltxpng/org_e7d761bed1cade664f3496421252f6aebdf30781.png |



  In this example both the lisp code and the results will be exported:

  #+BEGIN_SRC emacs-lisp :exports both
  (print "hello")
  #+END_SRC

  #+RESULTS:
  : hello


 #+BEGIN_SRC emacs-lisp

 #+END_SRC

** http
[[https://github.com/zweifisch/ob-http][ob-http]] mode
#+BEGIN_SRC http :pretty
GET https://api.github.com/repos/zweifisch/ob-http/languages
Accept: application/vnd.github.moondragon+json
#+END_SRC

#+RESULTS:
: {
:   "Shell": 139,
:   "Emacs Lisp": 13293
: }

**** :var lets you assign a variable at the top level header argument.
#+BEGIN_SRC calc :var x=5 y=6 z=50
x + y + z
#+END_SRC

#+RESULTS:
: 61

#+NAME:GAS
#+BEGIN_SRC calc
1.89
#+END_SRC

#+RESULTS: GAS
: 1.89

#+RESULTS:
: 1.89

***** you can assign a variable to the result of an org src code block
5 gallons of gas costs
#+BEGIN_SRC calc :var gas=GAS
5 * gas
#+END_SRC

#+RESULTS:
: 9.45

*** :dir
#+BEGIN_SRC sh :dir ~/manuals :results output
ls | grep -m 5 -e ".*org" -
#+END_SRC

#+RESULTS:
: accrisoft.org
: apache.org
: arch.org
: auto-complete.org
: bash.org

